---
title: 关于我
categories: [日常]
author: bingtangxh
date: 2025-01-13 20:25:00
updated: 2025-01-13 20:25:00
---

## 关于我这个人
嗯，这就开始了吗

那就，大家好，这里是 `冰糖xh`

{% folding child:codeblock `xh` 是双关含义 %}
在《喜羊羊与灰太狼羊村守护者 7 遨游神秘洋》中，角色 `冰糖` 的种族是雪狐。
而《喜羊羊与灰太狼》圈内通常简称 `喜灰` 。
因此这里的 `xh` 既可以是 `雪狐` ，也可以是 `喜灰` 。
{% endfolding %}

历史上有 2 个网名，为防止旧网名相关的迷惑用户找到此网名，想知道的可以在“联系方式”中询问。

## 我的成就

- 在某双非高校的 ACM-ICPC 程序设计校赛中单人成立队伍获得 铜 奖。

end of file

{% folding child:codeblock 别的都没有人认可 %}
好吧，既然你展开了，你是第 undefined + 1 个认可我的人   ——小智

- 在 2017-now 做了好几个 Windows 批处理文件，可在 [9826技术栖息地的灵感簿](http://9826hzg.ysepan.com) 和 [我的 GitHub](https://github.com/bingtangxh) 找到。
- 2020~2023 在 哔哩哔哩弹幕视频网 制作并发布了一些 Microsoft Windows 和 喜羊羊与灰太狼 相关的视频。由于迷惑人士的长期骚扰并且“不理他们”收效甚微，该账号已注销。
- 在 Ballance 社区中发布了几个自制地图和制作地图需要的脚本素材。

{% endfolding %}

## 我喜欢什么

其实吧，我认为刻意显现自己喜欢的东西是一种不太好的行为，像是在注定给自己贴上标签。

不过，为了快速找到志同道合的知己，下方还是列出了我自己喜欢的东西。

- Microsoft 相关
- 